[
    {
        "id": 1,
        "date": "3/23/2025",
        "mileage": "11,960",
        "picture": "/images/c8/dl32325-01.jpg",
        "cost": "$50 for event entry fee",
        "entry": "Today was Panda's first Autocross event of the 2025 season, and we had a blast! We ran with the local Lone Star Region Porsche Club of America (PCA) chapter at the Houston Police Academy. \n The course was definitely not a stock Corvette friendly course, and featured many decreasing radius turns which required a more momentum-car driving line with the driver-rear tire taking the majority of the abuse having to bleed-off speed as the radius would tighten up. \n But that said, it was still a ton of fun, and the Nanking Sportnex CR-S V2 tires continue to impress us with how easy they are to drive fast out of the gate and how easily they handle back to back co-driver runs. \n I was able to squeak out a 2nd place trophy in the X3 class out of six drivers, with my co-driver coming in 4th only  and we are looking forward to the next event in April."
    },
    {
        "id": 2,
        "date": "3/30/2025",
        "mileage": "12,705",
        "picture": "/images/c8/shoprally_03292025.jpg",
        "entry": "March 28th through the 30th was the the Shop Club’s 3rd annual Lonestar Rally, where 20 member’s cars gather in San Antonio and take a drive out to the three Twisted Sisters out in the Texas Hill Country for an afternoon of driving. \n\n I’ll cover the entire road trip in a much longer article for a “road trips” section of the site I am building, so this post will just cover some highlights. \n\n I was in the fastest run group, which comprised of two fellow track drivers. We set out from Leaky Texas down FM337 to Camp Wood, and north on FM336, a route I am extremely familiar with, just not in a C8 Corvette. \n I decided to try “track” mode first which proved to be overly stiff, causing the chassis to bounce and shake the entire time as it’s obviously meant for body control on a smooth surface like a race track. \n I ended up selecting Sport mode which proved to be an excellent blend of body-control and ride comfort. The steering was a little on the light side, but was never tiring, and the car had plenty of grip thanks to the track-alignment and the Nanking CRS V2 autocross-focused tires, allowing me to easily keep pace on corner-entry and in steady state cornering with the 991 911 GT3 and GT4 Cayman leading the group. \n The meaty torque band of the 6.2 liter LT2 was extremely approachable and was easily deployed on corner exit and allowed the C8 to easily keep pace with the Porsches on the long straights between the bends even with the top down. \n I also can’t say enough good things about this mid-engine architecture, it’s really taken the Corvette’s handling and poise to supercar levels by comparison to the original front-engine leaf-spring layout which could be a little tricky on this route. \n\n Overall, the car performed flawlessly and was extremely comfortable for the 3.5 hour drive out to Leakey, and even more so on the return trip back to Houston. I can’t wait to take it out again on another road trip soon! \n\n Special thanks to the Shop Club for organizing this event and allowing me to join in on the fun!"
    }
]
