[
    {
        "id": 1,
        "date": "10/3/2024",
        "mileage": "19,420",
        "picture": "images/nd/20241003_blanco_nd.jpg",
        "cost": "$0",
        "entry": "This weekend was a great road-trip with my brother out to Austin Texas to see “Stop Making Sense” by The Talking Heads in IMAX. \n Great movie, one of the all-time great concerts on film. The next day, we took off for Lime Creek Rd, a somewhat famous twisty road for driving and biking enthusiast with a reputation for being quite challenging. \n\n Hangovers abound the next morning from a night of fun, I didn’t attack the road in my usual enthusiastic style. But it was still a lot of fun and Kasumi performed beautifully, responding to every slight input on the throttle as well as it’s soft springs could possibly manage. \n The engine is still a joy to ring out, and on the KPC (Kinematic Posture Control) system did a good job of tightening the line when needed with a minor steering adjustment and keeping the body roll in check with the now worn-out OEM tires. \n I would say the one spot where the ND chassis never really does well, is the ride quality. The Bilstein dampers that come equipped will cause the tires to skip and chatter over various surfaces, and the oscillations from front to rear even on a smoother highway are rather ridiculous. It’s a weird case of too soft yet too firm linear-damper that feel very mismatched to the stock spring-rate. \n I suppose this is a good reason the car has an excellent AC system and the Apple/Android Auto infotainment system that try their best to distract you from the ride over the long haul.\n\n The best part of the trip however, was my brother suggesting and us executing an impromtu visit to the Blanco Pizza Company in Banco Texas. The pizza was absolutely amazing. The tomato sauce is more on the acid side avoiding the commercial-grade sweetness that most places use. The crust was thin and crispy, and the cheese was a perfect blend of mozzarella and parmesan. I would highly recommend this place to anyone who is in the area... Or making a trip to Lime Creek Rd."
    },
    {
        "id": 2,
        "date": "2/10/2025",
        "mileage": "20,450",
        "picture": "images/nd/20250203_084128.jpg",
        "cost": "$120.65",
        "entry": "I began noticing some strange handling behavior when turning left, like the inside rear wasn’t keeping contact with the road. A little weird, but another tip-off that something was amiss was the sudden degradation in ride quality.\n Some bouncy behavior is normal on these cars with the stock Bilsteins, but this was way more than normal. \n I began looking the car over and I found that the ride height was really off. So I took it over to GHM since she was due for an alignment anyway, where we promptly found that the lowest corner (driver’s rear) had a wet shock absorber.  This would indicate that the seal has failed, the monotube has lost its gas charge, and now oil was seeping out of the shock. Well good thing I still have my bumper-to-bumper warranty! Or so I thought…\n\n I took the car into the dealer I bought it from, Jeff Haas Mazda for its regular service and explained to them the situation with the shock. To probably nobody’s surprise but my own, they denied that the shock had a problem and then attempted to tell me that a Bilstein leaking fluid was “totally normal” for them. \n Well, that’s strike one. Strike two would happen just a little later when I was called and told that the same tire on that corner had a nail in it and that was probably what I had felt…. Right.\n Well, as if this could not get any more hilarious, I was also told that the nail was in an un-patchable spot (it wasn’t) and they couldn’t get the replacement tire. I told them to leave the car alone, just air of the tire and I’ll take it home. I did, and what do I find? They had already pulled the nail out without sourcing a replacement tire and the spot the nail was at was totally patchable, which I proceeded to do myself.\n As far as the leaking shock goes, I sourced a set of 500 mile replacement shocks for $100 dollars from a friend, so I’ll be doing that myself. Although, I am tempted to buy a set of Tecna coil-overs from 949 racing instead of going with the same Bilsteins… \n\n At the end of the day, Jeff Haas Mazda lost a customer, as did Mazda in general as I won’t buy from a company that won’t stand by its product."
    },
    {
        "id": 3,
        "date": "3/1/2025",
        "mileage": "21,000",
        "picture": "images/nd/20250301_001.jpg",
        "cost": "$0",
        "entry": "Kasumi got some TLC today down at the Shop Club Houston. \n What's really great about the Shop Club is that every wash bay has a foam cannon and a full scope of products, including bug-remover, wheel and tire cleaner, car soap, a wash bucket with a grit-gaurd in place at the bottom, a car-soap pre-mixing machine, and the option to use hot water. \n I brought a second 5 gallon wash bucket with a grit gaurd for rinsing the wash mitt I also brought with me. They do provide wash mitts, but I only use those for washing the wheels. \n After the wash phase I moved over to the detailing bay and dried the car. I then went over her with the Chemical Guys Ceramic Detailer, which they claim can act as a stand-alone product for paint protection... I'm not entirely convinced it's going to hold up over the next couple of months or a couple of repeat washings. \n \n I also took the time to clean the interior and vacuum the carpets and I have to say, I am really happy with how she looks now, although I did find some issues on the front bumper re-paint form Best Colision that I will need to bring up with them as soon as I have a chance to get back over there."
    },
    {
        "id": 4,
        "date": "5/14/2025",
        "mileage": "23,000",
        "picture": "images/nd/20250510_185356.jpg",
        "cost": "$0",
        "entry": "Kasumi hit the big 23,000 mile mark today. \n Started doing the math on it, and I realized I'll be running out of warranty on time instead of mileage for the first time ever in my entire life. \n I have never owned a car that I didn't drive into the ground, and this is the first time I've ever had a car that I didn't drive into the ground.... Outside of the Corvette of course. \n I guess it's a sign of maturity or something, but it is strange for me and my typical cycle of behavior. \n I also decided to give the Chemical Guys Spray-On Ceramic Detailer a shot to see how it does overall compared to a full day's worth of applying the Meguirar's ceramic out of the bottle. So far, it's been applied as easy as any spray-on detailer, and the results so far have been decent. But we're still in the short term test phase of only a few weeks. \n We'll have to see how it holds up over the next month or so to really gauge how durable it is. \n"
    },
    {
        "id": 5,
        "date": "9/23/2025",
        "mileage": "29,252",
        "picture": "images/nd/5065070.jpg",
        "cost": "Various trip expenses",
        "entry": "Just spent a solid week traveling through Tennessee and North Carolina with Kasumi, hitting up some of the best driving roads in the Southeast. \n We started off in Nashville, taking in some live music and the vibrant city life before heading east towards the Smoky Mountains. \n By day 3 we were finally at The Tail of the Dragon which was an absolute blast, with its 318 curves in just 11 miles providing a thrilling challenge for both driver and machine. Kasumi handled the twists and turns with grace, her suspension and chassis working in harmony to keep me planted on the road. \n It was so much fun in fact, I spent two days driving some 750+ miles in the area hitting every twisty road I could find including The Cherohala Skyway. \n Each road offered its own unique challenges and breathtaking scenery, making every mile a memorable experience. \n On the evenings, I made sure to explore the local cuisine and culture, indulging in some fantastic Southern BBQ and visiting quaint mountain towns. \n Overall, it was an unforgettable trip that not only tested Kasumi's capabilities but also allowed me to connect with the joy of driving on some of the most scenic roads in the country. \n This is a cursory write-up, I plan to do a more detailed Article post soon!"
    },
    {
        "id": 6,
        "date": "12/12/2025",
        "mileage": "32,336",
        "picture": "images/nd/20251207_110809.jpg",
        "cost": "$1400.00",
        "entry": "Kasumi is FINALLY riding on a set of Koni Sport dampers and I'm in the process of setting her up for SCCA C-street Autocross. \n A good friend of mine and I went out to run our usual test route to try out our new setups, and I have to say, I was really impressed. \n The first thing that struck me is that the Koni Sport dampers ride significatnly better thant he stock Bilsteins, this is at 1/4th turn off full soft front and rear. Once you start turning the damping up, the car's reflexes improve dramatically, the car tucks into the corner darting towards the apex in a far more eagerly and with superb control. This damper setup runs a stiffer rear bumpstop than stock and trimmed front stops, so the handling balance is naturally more over-steer biased (which is good). Next up on the list is a Karcepts front anti-swaybar and a swaybar mount reenforcement kit to keep the bar from tearing the front subframe apart under autcoross conditions. \n After that, it's just a matter of dialing in the alignment and tire pressures for the various autocross courses I plan to run at. \n Overall, I'm really excited about this new setup and can't wait to see how Kasumi performs on the autocross circuit!"
    }
]
