[
    {
        "id": 1,
        "date": "10/3/2024",
        "mileage": "19,420",
        "picture": "images/nd/20241003_blanco_nd.jpg",
        "cost": "$0",
        "entry": "This weekend was a great road-trip with my brother out to Austin Texas to see “Stop Making Sense” by The Talking Heads in IMAX. \n Great movie, one of the all-time great concerts on film. The next day, we took off for Lime Creek Rd, a somewhat famous twisty road for driving and biking enthusiast with a reputation for being quite challenging. \n\n Hangovers abound the next morning from a night of fun, I didn’t attack the road in my usual enthusiastic style. But it was still a lot of fun and Kasumi performed beautifully, responding to every slight input on the throttle as well as it’s soft springs could possibly manage. \n The engine is still a joy to ring out, and on the KPC (Kinematic Posture Control) system did a good job of tightening the line when needed with a minor steering adjustment and keeping the body roll in check with the now worn-out OEM tires. \n I would say the one spot where the ND chassis never really does well, is the ride quality. The Bilstein dampers that come equipped will cause the tires to skip and chatter over various surfaces, and the oscillations from front to rear even on a smoother highway are rather ridiculous. It’s a weird case of too soft yet too firm linear-damper that feel very mismatched to the stock spring-rate. \n I suppose this is a good reason the car has an excellent AC system and the Apple/Android Auto infotainment system that try their best to distract you from the ride over the long haul.\n\n The best part of the trip however, was my brother suggesting and us executing an impromtu visit to the Blanco Pizza Company in Banco Texas. The pizza was absolutely amazing. The tomato sauce is more on the acid side avoiding the commercial-grade sweetness that most places use. The crust was thin and crispy, and the cheese was a perfect blend of mozzarella and parmesan. I would highly recommend this place to anyone who is in the area... Or making a trip to Lime Creek Rd."
    },
    {
        "id": 2,
        "date": "3/1/2025",
        "mileage": "21,000",
        "picture": "images/nd/20250301_001.jpg",
        "cost": "$0",
        "entry": "Kasumi got some TLC today down at the Shop Club Houston. \n What's really great about the Shop Club is that every wash bay has a foam cannon and a full scope of products, including bug-remover, wheel and tire cleaner, car soap, a wash bucket with a grit-gaurd in place at the bottom, a car-soap pre-mixing machine, and the option to use hot water. \n I brought a second 5 gallon wash bucket with a grit gaurd for rinsing the wash mitt I also brought with me. They do provide wash mitts, but I only use those for washing the wheels. \n After the wash phase I moved over to the detailing bay and dried the car. I then went over her with the Chemical Guys Ceramic Detailer, which they claim can act as a stand-alone product for paint protection... I'm not entirely convinced it's going to hold up over the next couple of months or a couple of repeat washings. \n \n I also took the time to clean the interior and vacuum the carpets and I have to say, I am really happy with how she looks now, although I did find some issues on the front bumper re-paint form Best Colision that I will need to bring up with them as soon as I have a chance to get back over there."
    }
]
